LQM2015/stm32/Core/Src/audio_recorder.c
    // 停止SAI
    HAL_SAI_DMAStop(&hsai_BlockA4);
    recorder.state = AUDIO_REC_IDLE;
    
    SHELL_LOG_USER_INFO("Measurement complete:");
    SHELL_LOG_USER_INFO("- Elapsed time: %lu ms", elapsed_ms);
    SHELL_LOG_USER_INFO("- Complete callbacks: %lu", rx_complete_counter);
    SHELL_LOG_USER_INFO("- Half callbacks: %lu", rx_half_counter);
    
    if (rx_complete_counter >= 2) {
        // 计算平均时间间隔（整数运算）
    uint32_t avg_interval_ms = elapsed_ms / rx_complete_counter;
    uint32_t measured_rate_hz = (avg_interval_ms > 0U)
                    ? (expected_total_samples * 1000U) / avg_interval_ms
                    : 0U;
        
        SHELL_LOG_USER_INFO("Average callback interval: %lu ms", avg_interval_ms);
        SHELL_LOG_USER_INFO("Calculated external sample rate: %lu Hz", measured_rate_hz);
    SHELL_LOG_USER_INFO("Expected: %lu ms interval, %lu Hz rate",
                (unsigned long)expected_interval_ms,
                (unsigned long)active_sample_rate);
        
        if (measured_rate_hz < 8000) {
            SHELL_LOG_USER_ERROR("PROBLEM: External clock rate too low!");
            SHELL_LOG_USER_ERROR("Possible causes:");
            SHELL_LOG_USER_ERROR("1. External I2S/TDM clock source not running");
            SHELL_LOG_USER_ERROR("2. Wrong external clock frequency");
            SHELL_LOG_USER_ERROR("3. SAI should be in master mode instead");
        } else if (measured_rate_hz > 24000) {
            SHELL_LOG_USER_WARNING("External clock rate higher than expected");
        } else {
            SHELL_LOG_USER_INFO("External clock rate within reasonable range");
        }
    } else {
        SHELL_LOG_USER_ERROR("Insufficient callbacks for measurement - check external clock");
    }
    
    // 恢复原始计数器
    rx_complete_counter = backup_rx_complete;
    rx_half_counter = backup_rx_half;
    
    SHELL_LOG_USER_INFO("=== MEASUREMENT COMPLETE ===");
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize audio recorder
 * @retval 0: Success, -1: Error
 */
int audio_recorder_init(void)
{
    SHELL_LOG_USER_INFO("Initializing audio recorder...");
    
    // 清零文件对象确保干净状态，添加内存屏障
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();  // 确保内存清零完成
    
    // Initialize recorder structure
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    if (cfg != NULL) {
        recorder.channels = cfg->channels;
        recorder.bit_depth = cfg->bit_depth;
        recorder.sample_rate = cfg->sample_rate;
        recorder.buffer_size = audio_recorder_get_total_buffer_bytes();
    } else {
        recorder.channels = AUDIO_MAX_CHANNELS;
        recorder.bit_depth = AUDIO_SUPPORTED_BIT_DEPTH;
        recorder.sample_rate = 0U;
        recorder.buffer_size = AUDIO_DMA_BUFFER_SIZE_MAX;
    }
    recorder.state = AUDIO_REC_IDLE;
    recorder.bytes_written = 0;
    recorder.file_open = false;
    
    SHELL_LOG_USER_INFO("Config: %d channels, %d-bit, %d Hz, buffer size: %lu", 
           recorder.channels, recorder.bit_depth, recorder.sample_rate, (unsigned long)recorder.buffer_size);
    
    // Clear audio buffer
    memset(audio_buffer, 0, sizeof(audio_buffer));

    // Create message queue for audio data processing
    audio_data_queue = osMessageQueueNew(AUDIO_QUEUE_SIZE, sizeof(AudioDataItem_t), NULL);
    if (audio_data_queue == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio data queue");
        return -1;
    }
    SHELL_LOG_USER_INFO("Audio data queue created with size: %d", AUDIO_QUEUE_SIZE);

    // Create audio event thread (Must be higher priority than AudioProcess to preempt during recovery)
    // Uses osThreadFlags for ISR-safe signaling (more reliable than osEventFlags from ISR)
    const osThreadAttr_t audio_event_thread_attributes = {
        .name = "AudioEvent",
        .stack_size = 1024 * 2, 
        .priority = (osPriority_t) osPriorityRealtime,  // Highest priority to ensure immediate response
    };
    audio_event_thread_id = osThreadNew(audio_event_thread, NULL, &audio_event_thread_attributes);
    if (audio_event_thread_id == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio event thread");
        return -1;
    }
    SHELL_LOG_USER_INFO("Audio event thread created, thread_id=%p", audio_event_thread_id);

    // Create audio processing thread
    const osThreadAttr_t audio_process_thread_attributes = {
        .name = "AudioProcess",
        .stack_size = 1024 * 8, // 增加到8KB栈，因为AudioDataItem_t包含大数组
        .priority = (osPriority_t) osPriorityHigh,
    };
    audio_process_thread_id = osThreadNew(audio_process_thread, NULL, &audio_process_thread_attributes);
    if (audio_process_thread_id == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio processing thread");
        return -1;
    }
    
    SHELL_LOG_USER_INFO("Audio recorder initialization completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Reset audio recorder to clean state (force reset)
 * @retval 0: Success, -1: Error
 */
int audio_recorder_reset(void)
{
    SHELL_LOG_USER_INFO("Force resetting audio recorder...");
    SHELL_LOG_USER_DEBUG("Current state before reset: %d", recorder.state);
    
    // Force stop SAI if it's running
    if (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY) {
        SHELL_LOG_USER_INFO("Forcing SAI DMA stop...");
        HAL_SAI_DMAStop(&hsai_BlockA4);
        HAL_SAI_Abort(&hsai_BlockA4);
        
        // Wait for SAI to stop
        uint32_t timeout = HAL_GetTick() + 200;
        while (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY && HAL_GetTick() < timeout) {
            vTaskDelay(1);
        }
    }
    
    // Force close file if it's open
    if (recorder.file_open) {
        SHELL_LOG_USER_INFO("Force closing file...");
        f_close(&g_audio_file);
        recorder.file_open = false;
    }
    
    // Clear file object
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();
    
    // Reset all recorder state
    recorder.state = AUDIO_REC_IDLE;
    recorder.bytes_written = 0;
    recorder.write_in_progress = false;
    
    // Clear queue - remove any pending audio data items
    if (audio_data_queue != NULL) {
        AudioDataItem_t temp_item;
        // 清空队列中的所有待处理数据
        while (osMessageQueueGet(audio_data_queue, &temp_item, NULL, 0) == osOK) {
            // 数据已被丢弃
        }
        SHELL_LOG_USER_DEBUG("Audio data queue cleared");
    }
    
    // Reset counters
    rx_complete_counter = 0;
    rx_half_counter = 0;
    
    SHELL_LOG_USER_INFO("Audio recorder reset completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Start audio recording
 * @retval 0: Success, -1: Error
 */
int audio_recorder_start(void)
{
    FRESULT res;
    
    SHELL_LOG_USER_INFO("Starting audio recording...");
    SHELL_LOG_USER_DEBUG("Current state: %d (IDLE=%d, RECORDING=%d, STOPPING=%d, ERROR=%d)", 
                         recorder.state, AUDIO_REC_IDLE, AUDIO_REC_RECORDING, AUDIO_REC_STOPPING, AUDIO_REC_ERROR);
    
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    if (cfg != NULL) {
        recorder.channels = cfg->channels;
        recorder.bit_depth = cfg->bit_depth;
        recorder.sample_rate = cfg->sample_rate;
        recorder.buffer_size = audio_recorder_get_total_buffer_bytes();
    }

    // 如果已经在录音，直接返回错误但用更友好的消息
    if (recorder.state == AUDIO_REC_RECORDING) {
        SHELL_LOG_USER_INFO("Audio recording is already active");
        return -1;
    }
    
    // 如果在任何非空闲状态，尝试强制重置
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_WARNING("Recorder not in idle state (%d), attempting force reset...", recorder.state);
        audio_recorder_reset();
        
        // 再次检查状态
        if (recorder.state != AUDIO_REC_IDLE) {
            SHELL_LOG_USER_ERROR("Failed to reset recorder to idle state, current: %d", recorder.state);
            return -1;
        }
        SHELL_LOG_USER_INFO("Recorder successfully reset to idle state");
    }
    
