LQM2015/stm32/Core/Src/audio_recorder.c
    for (;;) {
        // Use osThreadFlagsWait - more reliable for ISR-to-thread signaling
        // This waits on flags set directly to THIS thread via osThreadFlagsSet()
        uint32_t flags = osThreadFlagsWait(AUDIO_THREAD_FLAG_RECOVERY_REQ, 
                                           osFlagsWaitAny, 
                                           osWaitForever);
        
        // Check for errors
        if ((int32_t)flags < 0) {
            SHELL_LOG_USER_ERROR("osThreadFlagsWait error: 0x%08X", flags);
            osDelay(100);
            continue;
        }
        
        SHELL_LOG_USER_INFO("Thread flags received: 0x%08X", flags);
                                        
        if ((flags & AUDIO_THREAD_FLAG_RECOVERY_REQ) == AUDIO_THREAD_FLAG_RECOVERY_REQ) {
            SHELL_LOG_USER_WARNING("Executing SAI recovery in event thread...");
            // s_sai_is_recovering is already set to true in ISR to block further errors
            
            // 1. Force Stop & Abort
            HAL_SAI_DMAStop(&hsai_BlockA4);
            HAL_SAI_Abort(&hsai_BlockA4);
            
            // 2. Small delay to ensure hardware reset propagates
            osDelay(10);
            
            // 2.1 Re-initialize SAI block to ensure clean state
            // Some flags are only cleared by SAI disable/enable cycle or Abort
            // We already did abort, but let's double check if we need to release specific locks
            // __HAL_UNLOCK(&hsai_BlockA4); // Not usually needed unless HAL is stuck
            
            // 3. Restart
            SHELL_LOG_USER_INFO("Attempting HAL_SAI_Receive_DMA restart...");
             HAL_StatusTypeDef restart_res = HAL_SAI_Receive_DMA(&hsai_BlockA4,
                                                              (uint8_t*)audio_buffer,
                                                              audio_recorder_get_total_buffer_samples());

            if (restart_res == HAL_OK) {
                SHELL_LOG_USER_INFO("SAI reception restarted successfully in event thread");
                
                // Force state back to RECORDING just in case it was changed
                if (recorder.state != AUDIO_REC_RECORDING) {
                    SHELL_LOG_USER_WARNING("Restoring state to RECORDING");
                    recorder.state = AUDIO_REC_RECORDING;
                }
            } else {
                SHELL_LOG_USER_ERROR("Failed to restart SAI in event thread: %d", restart_res);
                
                // If direct restart fails, try a harder reset (DeInit/Init)
                SHELL_LOG_USER_WARNING("Attempting hard reset of SAI peripheral...");
                HAL_SAI_DeInit(&hsai_BlockA4);
                MX_SAI4_Init();
                restart_res = HAL_SAI_Receive_DMA(&hsai_BlockA4,
                                                              (uint8_t*)audio_buffer,
                                                              audio_recorder_get_total_buffer_samples());
                if (restart_res == HAL_OK) {
                     SHELL_LOG_USER_INFO("SAI restarted after hard reset");
                     recorder.state = AUDIO_REC_RECORDING;
                } else {
                     SHELL_LOG_USER_ERROR("Hard reset failed: %d. Stopping recorder.", restart_res);
                     // If we really can't restart, we must stop.
                     audio_recorder_stop();
                     recorder.state = AUDIO_REC_ERROR;
                }
            }
            
            // Recovery complete, allow errors again
            s_sai_is_recovering = false;
        }
    }
}

/**
 * @brief Audio processing thread function
 * @param argument: Not used
 */
static void audio_process_thread(void *argument)
{
    (void)argument;
    AudioDataItem_t audio_item;
    
    SHELL_LOG_USER_INFO("Audio processing thread started");
    
    for (;;) {
        // Wait for audio data from the queue (blocking forever, so no timeouts when idle)
        osStatus_t status = osMessageQueueGet(audio_data_queue, &audio_item, NULL, osWaitForever);
        
        if (status == osOK) {
            //SHELL_LOG_USER_DEBUG("Processing audio data: %lu bytes", (unsigned long)audio_item.data_size);
            
            // Check if we're still recording
            if (recorder.state == AUDIO_REC_RECORDING) {
                // Process the received audio data
                int write_result = write_audio_data(audio_item.data, audio_item.data_size);
                
                if (write_result == -1) {
                    // 真正的写入错误
                    SHELL_LOG_USER_ERROR("Failed to write %s buffer, stopping recording.", 
                                        audio_item.is_half_buffer ? "first half" : "second half");
                    audio_recorder_stop();
                    recorder.state = AUDIO_REC_ERROR;
                } else if (write_result == -2) {
                    // 重入冲突，跳过但不设置错误状态
                    SHELL_LOG_USER_DEBUG("%s buffer write skipped due to reentry conflict",
                                        audio_item.is_half_buffer ? "First half" : "Second half");
                } else {
                    // 写入成功
                }
            } else {
                // 不在录音状态，丢弃数据
                SHELL_LOG_USER_DEBUG("Discarding audio data - not in recording state (state=%d)", recorder.state);
            }
        } else {
            // Should not happen with osWaitForever unless queue is deleted
            SHELL_LOG_USER_WARNING("Failed to get audio data from queue, status: %d", status);
        }
    }
}

/**
 * @brief Process audio data buffers. 
 * @note This function is now simplified as audio processing is handled by the queue-based thread.
 *       It only monitors SAI timing status.
 */
void audio_recorder_process(void)
{
    if (recorder.state != AUDIO_REC_RECORDING) {
        return;
    }

    // Monitor SAI timing status for Late Frame Sync issues
    monitor_sai_timing();
    
    // Note: Audio data processing is now handled by the audio_process_thread 
    // via queue mechanism for better real-time performance and data integrity.
}

/* Callback functions --------------------------------------------------------*/

/**
 * @brief SAI RX complete callback
 */
void audio_recorder_rx_complete_callback(void)
{
    /* Keep callbacks lightweight: reduced debug log frequency */
    rx_complete_counter++;
    if (rx_complete_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX complete (%lu)", (unsigned long)rx_complete_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        //SHELL_LOG_USER_DEBUG("RX complete callback triggered");
        
        // 准备队列数据项 - 后半缓冲区
        AudioDataItem_t audio_item;
        
    uint32_t half_bytes = audio_recorder_get_half_buffer_bytes();
    uint32_t half_samples = audio_recorder_get_half_buffer_samples();

    // 复制DMA数据到独立缓冲区，避免被硬件覆盖
    uint16_t* source_ptr = &audio_buffer[half_samples];  // 后半缓冲区
    memcpy(audio_item.data, source_ptr, half_bytes);
        __DSB();  // 确保内存复制完成
        
    audio_item.data_size = half_bytes;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = false;  // 完整回调 = 后半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count = 0;
            queue_full_count++;
            if (queue_full_count % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX complete callback! Lost count: %lu", queue_full_count);
            }
        } else {
            //SHELL_LOG_USER_DEBUG("Data queued successfully in RX complete");
        }
    }
}

/**
 * @brief SAI RX half complete callback
 */
void audio_recorder_rx_half_complete_callback(void)
{
    /* Half complete - reduced debug log frequency */
    rx_half_counter++;
    if (rx_half_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX half (%lu)", (unsigned long)rx_half_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        // 准备队列数据项 - 前半缓冲区
        AudioDataItem_t audio_item;
        
    uint32_t half_bytes = audio_recorder_get_half_buffer_bytes();

    // 复制DMA数据到独立缓冲区，避免被硬件覆盖
    uint16_t* source_ptr = &audio_buffer[0];  // 前半缓冲区
    memcpy(audio_item.data, source_ptr, half_bytes);
        __DSB();  // 确保内存复制完成
        
    audio_item.data_size = half_bytes;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = true;   // 半完成回调 = 前半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count_half = 0;
            queue_full_count_half++;
            if (queue_full_count_half % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX half callback! Lost count: %lu", queue_full_count_half);
            }
        }
    }
}

/**
 * @brief SAI error callback
 */
void audio_recorder_error_callback(void)
{
    SHELL_LOG_USER_ERROR("SAI error callback triggered! (state=%d)", recorder.state);
    
    // Check if ErrorCode is NONE. If so, this is likely a spurious callback
    // (possibly triggered by the recovery mechanism clearing flags and restarting DMA)
    if (hsai_BlockA4.ErrorCode == HAL_SAI_ERROR_NONE) {
        SHELL_LOG_USER_WARNING("Spurious SAI error callback (ErrorCode=0). Ignoring.");
        return;
    }

    // Check if recovery is already scheduled or in progress
    // If so, we acknowledge the error but don't let it stop the recording state
    // because the recovery thread is about to reset everything anyway.
    if (s_sai_is_recovering) {
        SHELL_LOG_USER_WARNING("SAI error 0x%08X occurred while recovery active. Ignoring.", (unsigned int)hsai_BlockA4.ErrorCode);
        
