LQM2015/stm32/Core/Src/audio_recorder.c
        // Clear flags to prevent infinite ISR loop if applicable
        __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET | SAI_FLAG_AFSDET | SAI_FLAG_CNRDY | SAI_FLAG_FREQ | SAI_FLAG_WCKCFG | SAI_FLAG_OVRUDR);
        hsai_BlockA4.ErrorCode = HAL_SAI_ERROR_NONE;
        return;
    }

    if (recorder.state == AUDIO_REC_RECORDING) {
        // Only log detailed status if we are not suppressing it logic
        // But here we are fresh error.
        
        // Check and provide specific error guidance
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("Late Frame Sync detected");
            // ... (keep existing logs) 
            
            // Try to clear the error and continue if possible
            __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET);
            hsai_BlockA4.ErrorCode &= ~HAL_SAI_ERROR_LFSDET;
            
            SHELL_LOG_USER_WARNING("Attempting to continue recording after LFSDET error");
            return;
        }

        // Recoverable Errors: AFSDET and DMA Error
        if ((hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) || (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_DMA)) {
            
            if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
                 SHELL_LOG_USER_ERROR("Anticipated Frame Sync detected - frame timing issue");
                 __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_AFSDET);
                 hsai_BlockA4.ErrorCode &= ~HAL_SAI_ERROR_AFSDET;
            }
            if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_DMA) {
                 SHELL_LOG_USER_ERROR("SAI DMA Error detected");
                 hsai_BlockA4.ErrorCode &= ~HAL_SAI_ERROR_DMA;
            }

            SHELL_LOG_USER_WARNING("Requesting SAI recovery via thread flag...");
            
            // Set global flag IMMEDIATELY to block subsequent error callbacks (like DMA error following AFSDET)
            s_sai_is_recovering = true;
            
            // Signal the event thread directly using thread flags (ISR-safe)
            if (audio_event_thread_id != NULL) {
                uint32_t set_result = osThreadFlagsSet(audio_event_thread_id, AUDIO_THREAD_FLAG_RECOVERY_REQ);
                if ((int32_t)set_result < 0) {
                    SHELL_LOG_USER_ERROR("osThreadFlagsSet failed: 0x%08X", (unsigned int)set_result);
                } else {
                    SHELL_LOG_USER_DEBUG("osThreadFlagsSet success, flags=0x%08X", (unsigned int)set_result);
                }
            } else {
                SHELL_LOG_USER_ERROR("audio_event_thread_id is NULL!");
            }
            return; // Exit without stopping the recorder state
        }
        
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("SAI Overrun - data not read fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and buffer handling");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("SAI Underrun - data not supplied fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and data flow");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("Wrong Clock Configuration detected");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI clock settings and PLL configuration");
        }
        
        recorder.state = AUDIO_REC_ERROR;
        
        // Stop DMA and close file
        HAL_SAI_DMAStop(&hsai_BlockA4);
        // if (recorder.file_open) {
        //     f_close(&recorder.file);
        //     recorder.file_open = false;
        // }
        
        SHELL_LOG_USER_ERROR("Recording stopped due to SAI error");
    }
}
